released/M480BSP_CAN_TX_RX_REMOTE/SampleCode/Template/main.c
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

#include "misc_config.h"

/*_____ D E C L A R A T I O N S ____________________________________________*/

struct flag_32bit flag_PROJ_CTL;
#define FLAG_PROJ_TIMER_PERIOD_1000MS                 	(flag_PROJ_CTL.bit0)
#define FLAG_PROJ_TRIG_CAN                   			(flag_PROJ_CTL.bit1)
#define FLAG_PROJ_REVERSE2                 				(flag_PROJ_CTL.bit2)
#define FLAG_PROJ_REVERSE3                              (flag_PROJ_CTL.bit3)
#define FLAG_PROJ_REVERSE4                              (flag_PROJ_CTL.bit4)
#define FLAG_PROJ_REVERSE5                              (flag_PROJ_CTL.bit5)
#define FLAG_PROJ_REVERSE6                              (flag_PROJ_CTL.bit6)
#define FLAG_PROJ_REVERSE7                              (flag_PROJ_CTL.bit7)


/*_____ D E F I N I T I O N S ______________________________________________*/

volatile unsigned int counter_systick = 0;
volatile uint32_t counter_tick = 0;

STR_CANMSG_T rrMsg = {0};

/*_____ M A C R O S ________________________________________________________*/

#define CAN_DEVICE_PORT						(CAN0)
#define CAN_DEVICE_IRQ						(CAN0_IRQHandler)

//tx
#define CAN_MSG_ID00						(0x301)	// CAN_STD_ID
#define CAN_MSG_ID01						(0xF502)

//rx
#define CAN_MSG_ID02						(0x401)	// CAN_STD_ID
#define CAN_MSG_ID03						(0xF504)

//tx
#define CAN_MSG_REMOTE_ID00					(0x501)	// CAN_STD_ID
#define CAN_MSG_REMOTE_ID01					(0xF8EE)

//rx
#define CAN_MSG_REMOTE_ID02					(0x601)	// CAN_STD_ID
#define CAN_MSG_REMOTE_ID03					(0xFAEE)

#define NORMAL_MSG_ID_ID00                  (22)
#define NORMAL_MSG_ID_ID01                  (23)
#define NORMAL_MSG_ID_ID02                  (16)
#define NORMAL_MSG_ID_ID03                  (17)

#define REMOTE_MSG_ID_ID00                  (20)
#define REMOTE_MSG_ID_ID01                  (21)
#define REMOTE_MSG_ID_ID02                  (18)
#define REMOTE_MSG_ID_ID03                  (19)

/*_____ F U N C T I O N S __________________________________________________*/
extern int32_t CAN_SetRxMsg_Remote(CAN_T *tCAN, uint32_t u32MsgNum, uint32_t u32IDType, uint32_t u32ID);

unsigned int get_systick(void)
{
	return (counter_systick);
}

void set_systick(unsigned int t)
{
	counter_systick = t;
}

void systick_counter(void)
{
	counter_systick++;
}

void SysTick_Handler(void)
{

    systick_counter();

    if (get_systick() >= 0xFFFFFFFF)
    {
        set_systick(0);      
    }

    // if ((get_systick() % 1000) == 0)
    // {
       
    // }

    #if defined (ENABLE_TICK_EVENT)
    TickCheckTickEvent();
    #endif    
}

void SysTick_delay(unsigned int delay)
{  
    
    unsigned int tickstart = get_systick(); 
    unsigned int wait = delay; 

    while((get_systick() - tickstart) < wait) 
    { 
    } 

}

void SysTick_enable(unsigned int ticks_per_second)
{
    set_systick(0);
    if (SysTick_Config(SystemCoreClock / ticks_per_second))
    {
        /* Setup SysTick Timer for 1 second interrupts  */
        printf("Set system tick error!!\n");
        while (1);
    }

    #if defined (ENABLE_TICK_EVENT)
    TickInitTickEvent();
    #endif
}

uint32_t get_tick(void)
{
	return (counter_tick);
}

void set_tick(uint32_t t)
{
	counter_tick = t;
}

void tick_counter(void)
{
	counter_tick++;
    if (get_tick() >= 60000)
    {
        set_tick(0);
    }
}

void delay_ms(uint16_t ms)
{
	#if 1
    uint32_t tickstart = get_tick();
    uint32_t wait = ms;
	uint32_t tmp = 0;
	
    while (1)
    {
		if (get_tick() > tickstart)	// tickstart = 59000 , tick_counter = 60000
		{
			tmp = get_tick() - tickstart;
		}
		else // tickstart = 59000 , tick_counter = 2048
		{
			tmp = 60000 -  tickstart + get_tick();
		}		
		
		if (tmp > wait)
			break;
    }
	
	#else
	TIMER_Delay(TIMER0, 1000*ms);
	#endif
}


//
// check_reset_source
//
uint8_t check_reset_source(void)
{
    uint32_t src = SYS_GetResetSrc();

    if ((SYS->CSERVER & SYS_CSERVER_VERSION_Msk) == 0x1)    // M48xGCAE
    {
		printf("PN : M48xGCAE\r\n");
    }
    else    // M48xIDAE
    {
		printf("PN : M48xIDAE\r\n");
    }

    SYS->RSTSTS |= 0x1FF;
    printf("Reset Source <0x%08X>\r\n", src);

    #if 1   //DEBUG , list reset source
    if (src & BIT0)
    {
        printf("0)POR Reset Flag\r\n");       
    }
    if (src & BIT1)
    {
        printf("1)NRESET Pin Reset Flag\r\n");       
    }
    if (src & BIT2)
    {
        printf("2)WDT Reset Flag\r\n");       
    }
    if (src & BIT3)
    {
        printf("3)LVR Reset Flag\r\n");       
    }
    if (src & BIT4)
    {
        printf("4)BOD Reset Flag\r\n");       
    }
    if (src & BIT5)
    {
        printf("5)System Reset Flag \r\n");       
    }
    if (src & BIT6)
    {
        printf("6)HRESET Reset Flag \r\n");       
    }
    if (src & BIT7)
    {
        printf("7)CPU Reset Flag\r\n");       
    }
    if (src & BIT8)
    {
        printf("8)CPU Lockup Reset Flag\r\n");       
    }
    #endif
    
    if (src & SYS_RSTSTS_PORF_Msk) {
        SYS_ClearResetSrc(SYS_RSTSTS_PORF_Msk);
        
        printf("power on from POR\r\n");
        return FALSE;
    }    
    else if (src & SYS_RSTSTS_PINRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_PINRF_Msk);
        
        printf("power on from nRESET pin\r\n");
        return FALSE;
    } 
    else if (src & SYS_RSTSTS_WDTRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_WDTRF_Msk);
        
        printf("power on from WDT Reset\r\n");
        return FALSE;
    }    
    else if (src & SYS_RSTSTS_LVRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_LVRF_Msk);
        
        printf("power on from LVR Reset\r\n");
        return FALSE;
    }    
    else if (src & SYS_RSTSTS_BODRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_BODRF_Msk);
        
        printf("power on from BOD Reset\r\n");
        return FALSE;
    }    
    else if (src & SYS_RSTSTS_SYSRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_SYSRF_Msk);
        
        printf("power on from System Reset\r\n");
        return FALSE;
    } 
    else if (src & SYS_RSTSTS_CPURF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_CPURF_Msk);

        printf("power on from CPU reset\r\n");
        return FALSE;         
    }    
    else if (src & SYS_RSTSTS_CPULKRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_CPULKRF_Msk);
        
        printf("power on from CPU Lockup Reset\r\n");
        return FALSE;
    }   
    
    printf("power on from unhandle reset source\r\n");
    return FALSE;
}


void CAN_ShowMsg(STR_CANMSG_T* Msg)
{
    uint8_t i;
    static uint32_t cnt = 0;

    UART_WAIT_TX_EMPTY(UART0);	
	//printf("\n\n");
    printf("cnt =%d,",cnt++);
	printf("MsgID[0x%04X]", Msg->Id);
	printf("Type=%s(0x%02X),",Msg->IdType?"EXT":"STD" ,Msg->IdType);
	// printf("Frame=%s(0x%02X),", Msg->FrameType?"DATA_FRAME":"REMOTE_FRAME" , Msg->FrameType);
	printf("length=0x%02X\r\n", Msg->DLC);
	printf("Data is: ");
	for(i=0; i<Msg->DLC; i++)
	{
		printf("0x%02X ,",Msg->Data[i]);
	}
	printf("\r\n");

}


void CAN_MsgInterrupt(CAN_T *tCAN, uint32_t u32IIDR)
{
	uint32_t u32MsgNum = 0;
	
	if(u32IIDR <= 32)
	{
		u32MsgNum = (u32IIDR-1);
		
		CAN_Receive(tCAN, u32MsgNum,&rrMsg);
        CAN_ShowMsg(&rrMsg);
	}
}

void CAN_IRQHandler(CAN_T *tCAN)
{
    uint32_t u8IIDRstatus;

    u8IIDRstatus = CAN_GET_INT_PENDING_STATUS(tCAN);

    if(u8IIDRstatus == 0x00008000)        /* Check Status Interrupt Flag (Error status Int and Status change Int) */
    {
        /**************************/
        /* Status Change interrupt*/
        /**************************/
        if(tCAN->STATUS & CAN_STATUS_RXOK_Msk)
        {
            tCAN->STATUS &= ~CAN_STATUS_RXOK_Msk;   /* Clear Rx Ok status*/

            printf("RX OK INT\n") ;
            while(!UART_IS_TX_EMPTY(UART0));
        }

        if(tCAN->STATUS & CAN_STATUS_TXOK_Msk)
        {
            tCAN->STATUS &= ~CAN_STATUS_TXOK_Msk;    /* Clear Tx Ok status*/

            printf("TX OK INT\n") ;
        }

        /**************************/
        /* Error Status interrupt */
        /**************************/
        if(tCAN->STATUS & CAN_STATUS_EWARN_Msk)
        {
            printf("EWARN INT\n") ;
        }

        if(tCAN->STATUS & CAN_STATUS_BOFF_Msk)
        {
            printf("BOFF INT\n") ;

            /* Do Init to release busoff pin */
            tCAN->CON = (CAN_CON_INIT_Msk | CAN_CON_CCE_Msk);
            tCAN->CON &= (~(CAN_CON_INIT_Msk | CAN_CON_CCE_Msk));
            while(tCAN->CON & CAN_CON_INIT_Msk);
        }
    }
    else if (u8IIDRstatus!=0)
    {
//        printf("=> Interrupt Pointer = %d\n",CAN_GET_INT_PENDING_STATUS(tCAN) -1);
//        printf("=> Interrupt Pointer = %d\n",u8IIDRstatus -1);

        CAN_MsgInterrupt(tCAN, u8IIDRstatus);

//        CAN_CLR_INT_PENDING_BIT(tCAN, (CAN_GET_INT_PENDING_STATUS(tCAN) -1));      /* Clear Interrupt Pending */
		CAN_CLR_INT_PENDING_BIT(tCAN, (u8IIDRstatus -1)); 

    }
    else if(tCAN->WU_STATUS == 1)
    {
        printf("Wake up\n");

        tCAN->WU_STATUS = 0;                       /* Write '0' to clear */
    }

}

/**
  * @brief  CAN1_IRQ Handler.
  * @param  None.
  * @return None.
  */
void CAN_DEVICE_IRQ(void)
{
//	printf("%s \r\n",__FUNCTION__);
	CAN_IRQHandler(CAN_DEVICE_PORT);

}


void DEVICE_SetRxMsg(CAN_T *tCAN)
{
    if(CAN_SetRxMsg(tCAN, MSG(NORMAL_MSG_ID_ID02),CAN_STD_ID, CAN_MSG_ID02) == FALSE)
    {
        printf("Set Rx Msg Object failed\n");
        return;
    }

    if(CAN_SetRxMsg(tCAN, MSG(NORMAL_MSG_ID_ID03),CAN_EXT_ID, CAN_MSG_ID03) == FALSE)
    {
        printf("Set Rx Msg Object failed\n");
        return;
    }

    if(CAN_SetRxMsg_Remote(tCAN, MSG(REMOTE_MSG_ID_ID02) ,CAN_STD_ID, CAN_MSG_REMOTE_ID02) == FALSE)
    {
        printf("Set Rx Msg Object failed\n");
        return;
    }

	if(CAN_SetRxMsg_Remote(tCAN, MSG(REMOTE_MSG_ID_ID03) ,CAN_EXT_ID, CAN_MSG_REMOTE_ID03) == FALSE)
    {
        printf("Set Rx Msg Object failed\n");
        return;
    }

    
	CAN_EnableInt(tCAN, CAN_CON_IE_Msk | CAN_CON_SIE_Msk);

    NVIC_SetPriority(CAN0_IRQn, 0);
    NVIC_EnableIRQ(CAN0_IRQn);

    // NVIC_SetPriority(CAN1_IRQn, 0);
    // NVIC_EnableIRQ(CAN1_IRQn);
}

void DEVICE_SetTxMsg_Remote_Frame(CAN_T *tCAN)
{
    // uint8_t i = 0;
    STR_CANMSG_T tMsg;

    printf("%s start\r\n",__FUNCTION__);

	tMsg.FrameType= CAN_REMOTE_FRAME;
	tMsg.IdType   = CAN_STD_ID;
	tMsg.Id       = CAN_MSG_REMOTE_ID00;
	tMsg.DLC      = 0;

    // for( i = 0 ; i < tMsg.DLC ; i++)
    // {
    //     tMsg.Data[i] = i;
    // }


	if(CAN_Transmit(tCAN, MSG(REMOTE_MSG_ID_ID00),&tMsg) == FALSE)   // Configure Msg RAM and send the Msg in the RAM
	{
		printf("Set Tx Msg Object failed\n");
		return;
	}

	tMsg.FrameType= CAN_REMOTE_FRAME;
	tMsg.IdType   = CAN_EXT_ID;
	tMsg.Id       = CAN_MSG_REMOTE_ID01;
	tMsg.DLC      = 0;

    // for( i = 0 ; i < tMsg.DLC ; i++)
    // {
    //     tMsg.Data[i] = 0x70+i;
    // }

	if(CAN_Transmit(tCAN, MSG(REMOTE_MSG_ID_ID01),&tMsg) == FALSE)   // Configure Msg RAM and send the Msg in the RAM
	{
		printf("Set Tx Msg Object failed\n");
		return;
	}	

    // UART_WAIT_TX_EMPTY(UART0);    
    while(!UART_IS_TX_EMPTY(UART0));
    printf("%s end\r\n",__FUNCTION__);  
	
}

void DEVICE_Tx(CAN_T *tCAN)
{
    STR_CANMSG_T tMsg;
    uint32_t i;
	const uint8_t can_data_00[5] = {0x30 , 0x31 , 0x32 , 0x33 , 0x34};

    static uint8_t cnt = 0;

    printf("%s start\r\n",__FUNCTION__);
	
    /* Send a 11-bits message */
    tMsg.FrameType= CAN_DATA_FRAME;
    tMsg.IdType   = CAN_STD_ID;
    tMsg.Id       = CAN_MSG_ID00;
    tMsg.DLC      = strlen((char*) can_data_00);	//SIZEOF(can_data_00);	//2;
	for ( i = 0 ; i < 5 ; i++)
	{
		tMsg.Data[i]  = can_data_00[i];
	}
    tMsg.Data[4] +=  tMsg.Data[4];

    if(CAN_Transmit(tCAN, MSG(NORMAL_MSG_ID_ID00),&tMsg) == FALSE) 
    {
        printf("Set Tx Msg Object failed\n");
        return;
    }

    /* Send a 29-bits message */
    tMsg.FrameType= CAN_DATA_FRAME;
    tMsg.IdType   = CAN_EXT_ID;
    tMsg.Id       = CAN_MSG_ID01;
    tMsg.DLC      = 8;
	for ( i = 0 ; i < 8 ; i++)
	{
		tMsg.Data[i]  = 0x70+i;
	}
    tMsg.Data[7] +=  cnt;
    printf("hex:0x%02X\r\n",tMsg.Data[7]);

    if(CAN_Transmit(tCAN, MSG(NORMAL_MSG_ID_ID01),&tMsg) == FALSE)
    {
        printf("Set Tx Msg Object failed\n");
        return;
    }
    
    // UART_WAIT_TX_EMPTY(UART0);	
    while(!UART_IS_TX_EMPTY(UART0));
    printf("%s end\r\n",__FUNCTION__);   
    cnt++;
}


void CAN_Setup(void)
{
    DEVICE_SetRxMsg(CAN_DEVICE_PORT);

    DEVICE_Tx(CAN_DEVICE_PORT);
       
	DEVICE_SetTxMsg_Remote_Frame(CAN_DEVICE_PORT);

}

void RS_PIN_Init(void)   // CAN transceiver RS pin , pull low
{
	PA2 = 0;
	PA3 = 0;

	SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA2MFP_Msk)) | (SYS_GPA_MFPL_PA2MFP_GPIO);
	SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA3MFP_Msk)) | (SYS_GPA_MFPL_PA3MFP_GPIO);

	GPIO_SetMode(PA,BIT2,GPIO_MODE_OUTPUT);
	GPIO_SetMode(PA,BIT3,GPIO_MODE_OUTPUT);
	
}

void CAN_Init(void)
{
    CAN_Open(CAN_DEVICE_PORT,  500000, CAN_NORMAL_MODE);
}

void TMR1_IRQHandler(void)
{
	
    if(TIMER_GetIntFlag(TIMER1) == 1)
    {
        TIMER_ClearIntFlag(TIMER1);
		tick_counter();

		if ((get_tick() % 1000) == 0)
		{
            FLAG_PROJ_TIMER_PERIOD_1000MS = 1;//set_flag(flag_timer_period_1000ms ,ENABLE);
		}

		if ((get_tick() % 50) == 0)
		{

		}	
    }
}

void TIMER1_Init(void)
{
    TIMER_Open(TIMER1, TIMER_PERIODIC_MODE, 1000);
    TIMER_EnableInt(TIMER1);
    NVIC_EnableIRQ(TMR1_IRQn);	
    TIMER_Start(TIMER1);
}

void loop(void)
{
	// static uint32_t LOG1 = 0;
	// static uint32_t LOG2 = 0;

    if ((get_systick() % 1000) == 0)
    {
        // printf("%s(systick) : %4d\r\n",__FUNCTION__,LOG2++);    
    }

    if (FLAG_PROJ_TIMER_PERIOD_1000MS)//(is_flag_set(flag_timer_period_1000ms))
    {
        FLAG_PROJ_TIMER_PERIOD_1000MS = 0;//set_flag(flag_timer_period_1000ms ,DISABLE);

        // printf("%s(timer) : %4d\r\n",__FUNCTION__,LOG1++);
        PH0 ^= 1;             
    }

    if (FLAG_PROJ_TRIG_CAN)
    {        
        DEVICE_Tx(CAN_DEVICE_PORT);
    }
}

void UARTx_Process(void)
{
	uint8_t res = 0;
	res = UART_READ(UART0);

	if (res > 0x7F)
	{
		printf("invalid command\r\n");
	}
	else
	{
		printf("press : %c\r\n" , res);
		switch(res)
		{
			case '1':
				DEVICE_SetTxMsg_Remote_Frame(CAN_DEVICE_PORT);
				break;
			case '2':
				DEVICE_Tx(CAN_DEVICE_PORT);
				break;
			case '3':
				FLAG_PROJ_TRIG_CAN = 1;
				break;
			case '4':
				FLAG_PROJ_TRIG_CAN = 0;
				break;

			case 'X':
			case 'x':
			case 'Z':
			case 'z':
                SYS_UnlockReg();
				// NVIC_SystemReset();	// Reset I/O and peripherals , only check BS(FMC_ISPCTL[1])
                // SYS_ResetCPU();     // Not reset I/O and peripherals
                SYS_ResetChip();    // Reset I/O and peripherals ,  BS(FMC_ISPCTL[1]) reload from CONFIG setting (CBS)	
				break;
		}
	}
}

void UART0_IRQHandler(void)
{
    if(UART_GET_INT_FLAG(UART0, UART_INTSTS_RDAINT_Msk | UART_INTSTS_RXTOINT_Msk))     /* UART receive data available flag */
    {
        while(UART_GET_RX_EMPTY(UART0) == 0)
        {
			UARTx_Process();
        }
    }

    if(UART0->FIFOSTS & (UART_FIFOSTS_BIF_Msk | UART_FIFOSTS_FEF_Msk | UART_FIFOSTS_PEF_Msk | UART_FIFOSTS_RXOVIF_Msk))
    {
        UART_ClearIntFlag(UART0, (UART_INTSTS_RLSINT_Msk| UART_INTSTS_BUFERRINT_Msk));
    }	
}

void UART0_Init(void)
{
    SYS_ResetModule(UART0_RST);

    /* Configure UART0 and set UART0 baud rate */
    UART_Open(UART0, 115200);

	/* Set UART receive time-out */
	UART_SetTimeoutCnt(UART0, 20);

	UART0->FIFO &= ~UART_FIFO_RFITL_4BYTES;
	UART0->FIFO |= UART_FIFO_RFITL_8BYTES;

	/* Enable UART Interrupt - */
	UART_ENABLE_INT(UART0, UART_INTEN_RDAIEN_Msk | UART_INTEN_TOCNTEN_Msk | UART_INTEN_RXTOIEN_Msk);
	
	NVIC_EnableIRQ(UART0_IRQn);

	#if (_debug_log_UART_ == 1)	//debug
	printf("\r\nCLK_GetCPUFreq : %8d\r\n",CLK_GetCPUFreq());
	printf("CLK_GetHCLKFreq : %8d\r\n",CLK_GetHCLKFreq());
	printf("CLK_GetHXTFreq : %8d\r\n",CLK_GetHXTFreq());
	printf("CLK_GetLXTFreq : %8d\r\n",CLK_GetLXTFreq());	
	printf("CLK_GetPCLK0Freq : %8d\r\n",CLK_GetPCLK0Freq());
	printf("CLK_GetPCLK1Freq : %8d\r\n",CLK_GetPCLK1Freq());
	printf("CLK_GetHCLKFreq : %8d\r\n",CLK_GetHCLKFreq());    	

//    printf("Product ID 0x%8X\n", SYS->PDID);
	
	#endif	

    #if 0
    printf("FLAG_PROJ_TIMER_PERIOD_1000MS : 0x%2X\r\n",FLAG_PROJ_TIMER_PERIOD_1000MS);
    printf("FLAG_PROJ_REVERSE1 : 0x%2X\r\n",FLAG_PROJ_REVERSE1);
    printf("FLAG_PROJ_REVERSE2 : 0x%2X\r\n",FLAG_PROJ_REVERSE2);
    printf("FLAG_PROJ_REVERSE3 : 0x%2X\r\n",FLAG_PROJ_REVERSE3);
    printf("FLAG_PROJ_REVERSE4 : 0x%2X\r\n",FLAG_PROJ_REVERSE4);
    printf("FLAG_PROJ_REVERSE5 : 0x%2X\r\n",FLAG_PROJ_REVERSE5);
    printf("FLAG_PROJ_REVERSE6 : 0x%2X\r\n",FLAG_PROJ_REVERSE6);
    printf("FLAG_PROJ_REVERSE7 : 0x%2X\r\n",FLAG_PROJ_REVERSE7);
    #endif

}

void GPIO_Init(void)
{
	SYS->GPH_MFPL = (SYS->GPH_MFPL & ~(SYS_GPH_MFPL_PH0MFP_Msk)) | (SYS_GPH_MFPL_PH0MFP_GPIO);
	SYS->GPH_MFPL = (SYS->GPH_MFPL & ~(SYS_GPH_MFPL_PH1MFP_Msk)) | (SYS_GPH_MFPL_PH1MFP_GPIO);
	SYS->GPH_MFPL = (SYS->GPH_MFPL & ~(SYS_GPH_MFPL_PH2MFP_Msk)) | (SYS_GPH_MFPL_PH2MFP_GPIO);

	//EVM LED
	GPIO_SetMode(PH,BIT0,GPIO_MODE_OUTPUT);
	GPIO_SetMode(PH,BIT1,GPIO_MODE_OUTPUT);
	GPIO_SetMode(PH,BIT2,GPIO_MODE_OUTPUT);
	
}

void SYS_Init(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Set XT1_OUT(PF.2) and XT1_IN(PF.3) to input mode */
    PF->MODE &= ~(GPIO_MODE_MODE2_Msk | GPIO_MODE_MODE3_Msk);

    CLK_EnableXtalRC(CLK_PWRCTL_HIRCEN_Msk);
    CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

    CLK_EnableXtalRC(CLK_PWRCTL_HXTEN_Msk);
    CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);

//    CLK_EnableXtalRC(CLK_PWRCTL_LIRCEN_Msk);
//    CLK_WaitClockReady(CLK_STATUS_LIRCSTB_Msk);

//    CLK_EnableXtalRC(CLK_PWRCTL_LXTEN_Msk);
//    CLK_WaitClockReady(CLK_STATUS_LXTSTB_Msk);

    /* Set core clock as PLL_CLOCK from PLL */
    CLK_SetCoreClock(FREQ_192MHZ);
    /* Set PCLK0/PCLK1 to HCLK/2 */
    CLK->PCLKDIV = (CLK_PCLKDIV_APB0DIV_DIV2 | CLK_PCLKDIV_APB1DIV_DIV2);

    /* Enable UART clock */
    CLK_EnableModuleClock(UART0_MODULE);
    /* Select UART clock source from HXT */
    CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART0SEL_HIRC, CLK_CLKDIV0_UART0(1));

    /* Set GPB multi-function pins for UART0 RXD and TXD */
    SYS->GPB_MFPH &= ~(SYS_GPB_MFPH_PB12MFP_Msk | SYS_GPB_MFPH_PB13MFP_Msk);
    SYS->GPB_MFPH |= (SYS_GPB_MFPH_PB12MFP_UART0_RXD | SYS_GPB_MFPH_PB13MFP_UART0_TXD);

    CLK_EnableModuleClock(TMR1_MODULE);
    CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1SEL_HIRC, 0);

    CLK_EnableModuleClock(CAN0_MODULE);
    // CLK_EnableModuleClock(CAN1_MODULE);

    /* Set PA multi-function pins for CAN0 RXD(PA.4) and TXD(PA.5) */
    SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA4MFP_Msk | SYS_GPA_MFPL_PA5MFP_Msk)) |
                    (SYS_GPA_MFPL_PA4MFP_CAN0_RXD | SYS_GPA_MFPL_PA5MFP_CAN0_TXD);

    // /* Set PE multi-function pins for CAN1 TXD(PE.7) and RXD(PE.6) */
    // SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB6MFP_Msk | SYS_GPB_MFPL_PB7MFP_Msk)) |
    //                 (SYS_GPB_MFPL_PB6MFP_CAN1_RXD | SYS_GPB_MFPL_PB7MFP_CAN1_TXD);

	
    /* Update System Core Clock */
    /* User can use SystemCoreClockUpdate() to calculate SystemCoreClock. */
    SystemCoreClockUpdate();

    /* Lock protected registers */
    SYS_LockReg();
}

/*
 * This is a template project for M480 series MCU. Users could based on this project to create their
 * own application without worry about the IAR/Keil project settings.
 *
 * This template application uses external crystal as HCLK source and configures UART0 to print out
 * "Hello World", users may need to do extra system configuration based on their system design.
 */

int main()
{
    SYS_Init();

	GPIO_Init();
	UART0_Init();
	TIMER1_Init();
    check_reset_source();

    SysTick_enable(1000);
    #if defined (ENABLE_TICK_EVENT)
    TickSetTickEvent(1000, TickCallback_processA);  // 1000 ms
    TickSetTickEvent(5000, TickCallback_processB);  // 5000 ms
    #endif

    RS_PIN_Init();
	CAN_Init();
	CAN_Setup();

    /* Got no where to go, just loop forever */
    while(1)
    {
        loop();

    }
}

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/
